Revit 2026 API

# DocumentSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DocumentSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
DocumentSetIterator()
```
```fsharp
new : unit -> DocumentSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

DocumentSetIterator Class

Autodesk.Revit.DB Namespace